nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core0.xml
        <register>
          <name>LDO_1</name>
          <description>RF Analog Baseband LDO Control 2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDO_ANT_TRIM</name>
              <description>reg_ldo_ant_trim_dig[3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_0</name>
                  <description>0.91 V ( Default )</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_1</name>
                  <description>0.97 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_2</name>
                  <description>1.04 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_3</name>
                  <description>1.12 V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_4</name>
                  <description>1.21 V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_5</name>
                  <description>1.32 V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_6</name>
                  <description>1.45 V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_7</name>
                  <description>1.52 V</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_8</name>
                  <description>1.61 V</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_9</name>
                  <description>1.80 V</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_10</name>
                  <description>2.06 V</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_11</name>
                  <description>2.13 V</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_12</name>
                  <description>2.21 V</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_13</name>
                  <description>2.30 V</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_14</name>
                  <description>2.39 V</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_TRIM_15</name>
                  <description>2.50 V</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_ANT_POWMOD_SEL</name>
              <description>LDO_ANT_POWMOD_SEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_ANT_POWMOD_SEL_0</name>
                  <description>KW45 Legacy mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_POWMOD_SEL_1</name>
                  <description>When pup is low, force HiZ mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_ANT_HIZ</name>
              <description>reg_ldo_ant_hiz_dig</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_ANT_HIZ_0</name>
                  <description>high-impedance disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_HIZ_1</name>
                  <description>high-impedance enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_ANT_BYPASS</name>
              <description>reg_ldo_ant_bypass_dig</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_ANT_BYPASS_0</name>
                  <description>ANT bypass disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_BYPASS_1</name>
                  <description>ANT bypass enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_ANT_REF_SEL</name>
              <description>reg_ldo_ant_ref_sel_dig</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_ANT_REF_SEL_0</name>
                  <description>sel type disable ( Default )</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_ANT_REF_SEL_1</name>
                  <description>sel type enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XO_DIST</name>
          <description>RF Analog XO DIST Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XO_DIST_TRIM</name>
              <description>reg_xo_dist_trim_dig[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_DIST_TRIM_0</name>
                  <description>0.9 V ( Default )</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_TRIM_1</name>
                  <description>0.86 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_TRIM_2</name>
                  <description>0.95 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_TRIM_3</name>
                  <description>1.21 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XO_DIST_FLIP</name>
              <description>reg_xo_dist_flip_dig</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_DIST_FLIP_0</name>
                  <description>XO DIST doesn't flip the output clock relative to input clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_FLIP_1</name>
                  <description>XO DIST flip the output clock relative to input clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XO_DIST_BYPASS</name>
              <description>reg_xo_dist_bypass</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_DIST_BYPASS_0</name>
                  <description>XO DIST not bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_DIST_BYPASS_1</name>
                  <description>XO DIST bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL</name>
          <description>RF Analog PLL Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x74240</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_TRIM_KVT</name>
              <description>reg_vco_trim_kvt_dig[2:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVT_0</name>
                  <description>50MHz/V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVT_4</name>
                  <description>60MHz/V for fref = 32M</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVT_6</name>
                  <description>70MHz/V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVT_7</name>
                  <description>80MHz/V for fref = 26M</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_EN_PKDET</name>
              <description>reg_vco_en_pkdet_dig</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_EN_PKDET_0</name>
                  <description>PKDET disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_EN_PKDET_1</name>
                  <description>PKDET enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIC_VREF_CTRL</name>
              <description>reg_pic_vref_ctrl_dig[1:0]</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIC_VREF_CTRL_0</name>
                  <description>VREF=0.268*VDDX (VREF=245 mV for VDDX=0.9 V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_VREF_CTRL_1</name>
                  <description>VREF=0.292*VDDX (VREF=266 mV for VDDX=0.9 V)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_VREF_CTRL_2</name>
                  <description>VREF=0.317*VDDX (VREF=287 mV for VDDX=0.9 V)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_VREF_CTRL_3</name>
                  <description>VREF=0.341*VDDX (VREF=307 mV for VDDX=0.9 V) - (recommended setting)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIC_SMOOTH_SWITCH_EN</name>
              <description>reg_pic_smooth_switch_en_dig</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIC_SMOOTH_SWITCH_EN_0</name>
                  <description>smoothing disable (recommended setting)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_PIC_INPUT_EN</name>
              <description>reg_vco_pic_input_en_dig</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_PIC_INPUT_EN_0</name>
                  <description>PIC_INPUT disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_PIC_INPUT_EN_1</name>
                  <description>PIC_INPUT enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIC_RINT1_HVAL_SM_EN</name>
              <description>reg_pic_rint1_hval_sm_en_dig</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIC_RINT1_HVAL_SM_EN_0</name>
                  <description>PIC_RINT1_HVAL_SM disable (Rint1=30 kohms) - (recommended setting)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_RINT1_HVAL_SM_EN_1</name>
                  <description>PIC_RINT1_HVAL_SM enable (Rint1=60 kohms)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIC_RINT2_VAL_SLOW_MODE</name>
              <description>reg_pic_rint2_val_slow_mode_dig[1:0]</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIC_RINT2_VAL_SLOW_MODE_0</name>
                  <description>Rint2=90 kohms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_RINT2_VAL_SLOW_MODE_1</name>
                  <description>Rint2=210 kohms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_RINT2_VAL_SLOW_MODE_2</name>
                  <description>Rint2=450 kohms (recommended setting)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_RINT2_VAL_SLOW_MODE_3</name>
                  <description>Rint2=450 kohms</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIC_SPARE</name>
              <description>reg_pic_spare_dig[1:0]</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUXCREF_DIVN</name>
              <description>reg_muxcref_divn</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_PD_EN_VPD_PULLDN</name>
              <description>reg_pd_en_vpd_pulldn_dig</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_PD_EN_VPD_PULLDN_0</name>
                  <description>not pull down vpd output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_EN_VPD_PULLDN_1</name>
                  <description>pull down vpd output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PD_EN_VPD_PULLUP</name>
              <description>reg_pd_en_vpd_pullup_dig</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_PD_EN_VPD_PULLUP_0</name>
                  <description>not pull up vpd output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_EN_VPD_PULLUP_1</name>
                  <description>pull up vpd output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PD_TRIM_FCAL_BIAS</name>
              <description>reg_pd_trim_fcal_bias_dig[1:0]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_PD_TRIM_FCAL_BIAS_0</name>
                  <description>0.276V (recommended setting for legacy operation)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_TRIM_FCAL_BIAS_1</name>
                  <description>0.164V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_TRIM_FCAL_BIAS_2</name>
                  <description>0.320V (recommended setting for PIC use)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_PD_TRIM_FCAL_BIAS_3</name>
                  <description>0.391V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LODIV_SYNC_SPARE</name>
              <description>reg_lodiv_sync_spare_dig[1:0]</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_FCAL_EN_STATIC_RES</name>
              <description>reg_fcal_en_static_res_dig</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_FCAL_EN_STATIC_RES_0</name>
                  <description>resistor is dynamically switched during FCAL operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_FCAL_EN_STATIC_RES_1</name>
                  <description>resistor is always on during FCAL operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
